#define LCDBOTTOMEXT
#include "Include.h"

/*
void MemSet(uint8x* des,uint8 value,uint8 len);


void MemSet(uint8x* des,uint8 value,uint8 len)
{
    while(len--)
    {
        *(des++)=value;
    }

}
*/




/*=========================================================================================\n
* @function_name: InitLCD
* @function_file: McuDrive.c
* @描述: 初始化LCD
* 
* @参数: 
* @返回: 
* @作者:   lwb (2012-02-27)
* @备注: 
*-------------------------------------------------------------------------------------------
* @修改人:  
* @修改内容: 
===========================================================================================*/
void InitLCD(void)
{
//LCD显示，必须配置为禁止输入输出
    //P4OE |= 0x0f;           // P4.0~P4.3
    //P5OE |= 0xff;           // P5.0~P5.7
    //P6OE |= 0xff;           // P6.0~P6.7
    //P7OE |= 0x3c;           // P7.2~P7.5 共4+8+8+4=24
    
    //P4IE &=~ 0x0f;          // P4.0~P4.3
    //P5IE &=~ 0xff;          // P5.0~P5.7
    //P6IE &=~ 0xff;          // P6.0~P6.7
    //P7IE &=~ 0x3c;          // P7.2~P7.5

    //LCDG=0;
    //CtrlLCDV=0x00;
    //LCDCtrl=LCDSETTING4COM;     //0x82  4com 300k 256hz 开启lcd
    //SegCtrl0=0x0f;				//开启各个seg输出
    //SegCtrl1=0xff;
    //SegCtrl2=0xff;
    //SegCtrl3=0x3c;
    //SegCtrl4=0x00;
						//相应seg禁止输出
	GPIOD->OEN |= 0XF0F0;						//IOD4 5 6 7 12 13 14 15
	GPIOB->OEN |= 0X0030;						//IOB4 5 
	GPIOA->OEN |= 0XC000;						//IOA14 15
	GPIOA->OEN |= 0X0FFF;						//IOC0-11
						//相应seg禁止输入
	GPIOD->IE &=~ 0X0F0F;						//IOD4 5 6 7 12 13 14 15
	GPIOB->IE &=~ 0XFFCF;						//IOB4 5 
	GPIOA->IE &=~ 0X3FFF;						//IOA14 15
	GPIOA->IE &=~ 0XF000;						//IOC0-11
	
	//LCD->CTRL |= LCD_TYPE_4COM;		//bit7 en  bit54 type bit32 drvR bit10 frq
	LCD->CTRL &=~ BIT4;				//TYPE 00 4COM
	LCD->CTRL &=~ BIT5;
	LCD->CTRL &=~ BIT2;				//DRVR 00 300K
	LCD->CTRL &=~ BIT3;
	LCD->CTRL |= BIT1;				//FRQ 10 256HZ
	
	//LCD->CTRL2 |= (7<<8);			//swpr位 帧缓存切换时间设置0.5s*（swpr+1）
	//LCD->CTRL2 |= LCD_FBMODE_BUFAB;
	//LCD->CTRL2 |= LCD_BKFILL_1;
	LCD->CTRL2 = 0;
					
	LCD->SEGCTRL0 = 0x0FFFFF0F;		//使能对应seg	0-3 8-27 0FFF FF0F
	ANA->REG6 = 0;			// 1/3bias
	LCD->CTRL |=0X80;		//使能lcd
	
}
/*=========================================================================================\n
* @function_name: LCDInitSleep
* @function_file: LcdBottom.c
* @描述: 唤醒LCD初始化
* 
* @参数: 
* @返回: 
* @作者:   lwb (2012-06-03)
* @备注: 
*-------------------------------------------------------------------------------------------
* @修改人:  
* @修改内容: 
===========================================================================================*/
void LCDInitSleep(void)
{
     //LCDG=0;
    //CtrlLCDV=0x00;
    //LCDCtrl=LCDSETTING4COM;

    //SegCtrl0=0x0f;
    //SegCtrl1=0xff;
    //SegCtrl2=0xff;
    //SegCtrl3=0x3c;
    //SegCtrl4=0x00;

	LCD->CTRL &=~ BIT4;				//TYPE 00 4COM
	LCD->CTRL &=~ BIT5;
	LCD->CTRL &=~ BIT2;				//DRVR 00 300K
	LCD->CTRL &=~ BIT3;
	LCD->CTRL |= BIT1;				//FRQ 10 256HZ
	LCD->CTRL2 = 0;
					
	LCD->SEGCTRL0 = 0x0FFFFF0F;		//使能对应seg	0-3 8-27 0FFF FF0F
	ANA->REG6 = 0;			// 1/3bias
	LCD->CTRL |=0X80;		//使能lcd
    
}
/*=========================================================================================\n
* @function_name: LCD_On
* @function_file: LcdBottom.c
* @描述:
*
* @参数:
* @返回:
* @作者:   lwb (2012-03-15)
* @备注:
*-------------------------------------------------------------------------------------------
* @修改人:
* @修改内容:
===========================================================================================*/
void LCD_On(void)
{

}
/*=========================================================================================\n
* @function_name: LCD_Off
* @function_file: LcdBottom.c
* @描述:
*
* @参数:
* @返回:
* @作者:   lwb (2012-03-15)
* @备注:
*-------------------------------------------------------------------------------------------
* @修改人:
* @修改内容:
===========================================================================================*/
void LCD_Off(void)
{
    Disp_Clear();

	
    //SegCtrl0=0;
    //SegCtrl1=0;
    //SegCtrl2=0;
    //SegCtrl3=0;
    //SegCtrl4=0;
    //LCDCtrl=0;
    //LCDG=1;
	LCD->SEGCTRL0 = 0;		//禁止对应seg	0-3 8-27 0FFF FF0F
	LCD->CTRL &=~ 0X7F;		//关闭lcd
	

}

/*=========================================================================================\n
* @function_name: Disp_Clear
* @function_file: Lcd.c
* @描述:
*
* @参数:
* @返回:
* @作者:   lwb (2012-02-27)
* @备注:
*-------------------------------------------------------------------------------------------
* @修改人:
* @修改内容:
===========================================================================================*/
void Disp_Clear(void)
{
    MemSet(guc_LCDRAM, 0,Const_LCDRAMLen);
    LCD_RAMUpdata();
}


/*=========================================================================================\n
* @function_name: Disp_Full
* @function_file: Lcd.c
* @描述: 全屏显示
*
* @参数:
* @返回:
* @作者:   lwb (2012-02-27)
* @备注:
*-------------------------------------------------------------------------------------------
* @修改人:
* @修改内容:
===========================================================================================*/
void Disp_Full(void)
{
    MemSet(guc_LCDRAM, 0xff,Const_LCDRAMLen);
    LCD_RAMUpdata();
}
/*=========================================================================================\n
* @function_name: Dsip_Clr
* @function_file: LcdBottom.c
* @描述: 显示CLR-00
* 
* @参数: 
* @返回: 
* @作者:   lwb (2012-06-06)
* @备注: 
*-------------------------------------------------------------------------------------------
* @修改人:  
* @修改内容: 
===========================================================================================*/
void Dsip_Clr(void)
{
    MemSet(guc_LCDRAM, 0,Const_LCDRAMLen);
    Disp_Numb(0x00000000,0xAA723100);
    LCD_RAMUpdata();
}
/*=========================================================================================\n
* @function_name: LCD_RAMUpdata
* @function_file: LcdBottom.c
* @描述:
*
* @参数:
* @返回:
* @作者:   lwb (2012-03-15)
* @备注:
*-------------------------------------------------------------------------------------------
* @修改人:
* @修改内容:
===========================================================================================*/
void LCD_RAMUpdata(void)
{
    RefreshLCDRAM(guc_LCDRAM);
}

/*=========================================================================================\n
* @function_name: RefreshLCDRAM
* @function_file: DispPlay.c
* @描述: 把缓存显示数据刷新到LCD RAM中
*
*
* @参数：
* @param: p  缓存首地址，该缓存对应的是SEG2到SEG39，每个SEG对应1个字节
*
* @返回：
* @作者: lim (2011-11-02)
* @备注:
*-------------------------------------------------------------------------------------------
* @修改人:
* @修改内容:
===========================================================================================*/
/*
void RefreshLCDRAM(uint8 *p)
{
    uint8 i;
    uint8x  *pLCDM;

    pLCDM=(uint8x*)&LCDM0;
    *pLCDM = p[0];
    *(pLCDM+1) = p[1];
    for(i=0; i<4 ;i++)
    {
        *(pLCDM+i+4) = p[i+2];
        *(pLCDM+i+8) = p[i+6];
    }
   
    *(pLCDM+13) = p[10];
    *(pLCDM+14) = p[11];
}*/

void RefreshLCDRAM(uint8 *p)
{
    uint8 i;
    uint8  *pLCDM;

    pLCDM=(uint8*)&LCD->FB[0];
    
    for(i=0; i<4 ;i++)
    {
        *(pLCDM+i) = p[23-i];
    }
    
    for(i=0; i<20 ;i++)
    {
        *(pLCDM+i+8) = p[19-i];
    }

    
    /*
    for(i=0; i<4 ;i++)
    {
        *(pLCDM+i) = p[i];
    }

	for(i=0; i<20 ;i++)
    {
      *(pLCDM+i+8) = p[i+4];
    }
   */
}
